{"text": "Precipitation thresholds are used in many areas to provide early warning of precipitation-induced landslides and debris flows, and the software distribution THRESH is designed for automated tracking of precipitation, including precipitation forecasts, relative to thresholds for landslide occurrence. This software is also useful for analyzing multiyear precipitation records to compare timing of threshold exceedance with dates and times of historical landslides. This distribution includes the main program THRESH for comparing precipitation to several kinds of thresholds, two utility programs, and a small collection of Python and shell scripts to aid the automated collection and formatting of input data and the graphing and further analysis of output results. The software programs can be deployed on computing platforms that support Fortran 95, Python 2, and certain Unix commands. The software handles rainfall intensity-duration thresholds, cumulative recent-antecedent precipitation thresholds, and peak intensity thresholds as well as various measures of antecedent precipitation. Users should have predefined rainfall thresholds before running THRESH."}
{"text": "The Transient Rainfall Infiltration and Grid-Based Regional Slope-Stability Model (TRIGRS) is a Fortran program designed for modeling the timing and distribution of shallow, rainfall-induced landslides. The program computes transient pore-pressure changes, and attendant changes in the factor of safety, due to rainfall infiltration. The program models rainfall infiltration, resulting from storms that have durations ranging from hours to a few days, using analytical solutions for partial differential equations that represent one-dimensional, vertical flow in isotropic, homogeneous materials for either saturated or unsaturated conditions. Use of step-function series allows the program to represent variable rainfall input, and a simple runoff routing model allows the user to divert excess water from impervious areas onto more permeable downslope areas. The TRIGRS program uses a simple infinite-slope model to compute factor of safety on a cell-by-cell basis. An approximate formula for effective stress in unsaturated materials aids computation of the factor of safety in unsaturated soils. Horizontal heterogeneity is accounted for by allowing material properties, rainfall, and other input values to vary from cell to cell. This command-line program is used in conjunction with geographic information system (GIS) software to prepare input grids and visualize model results."}
{"text": "The U.S. Geological Survey developed the Massachusetts Reservoir Simulation Tool to examine the effects of reservoirs on natural streamflows in Massachusetts by simulating the daily water balance of reservoirs. The simulation tool was developed to assist environmental managers to better manage water withdrawals in reservoirs and to preserve downstream aquatic habitats."}
{"text": "This report describes a monthly water-balance model driven by a graphical user interface, referred to as the Thornthwaite monthly water-balance program. Computations of monthly water-balance components of the hydrologic cycle are made for a specified location. The program can be used as a research tool, an assessment tool, and a tool for classroom instruction."}
{"text": "An urban pollutant loading model was used to demonstrate how incorrect assumptions on the particle size distribution (PSD) in urban runoff can alter the design characteristics of stormwater control measures (SCMs) used to remove solids in stormwater. Field-measured PSD, although highly variable, is generally coarser than the widely-accepted PSD characterized by the Nationwide Urban Runoff Program (NURP). PSDs can be predicted based on environmental surrogate data. There were no appreciable differences in predicted PSD when grouped by season. Model simulations of a wet detention pond and catch basin showed a much smaller surface area is needed to achieve the same level of solids removal using the median value of field-measured PSD as compared to NURP PSD. Therefore, SCMs that used the NURP PSD in the design process could be unnecessarily oversized. The median of measured PSDs, although more site-specific than NURP PSDs, could still misrepresent the efficiency of an SCM because it may not adequately capture the variability of individual runoff events. Future pollutant loading models may account for this variability through regression with environmental surrogates, but until then, without proper site characterization, the adoption of a single PSD to represent all runoff conditions may result in SCMs that are under- or over-sized, rendering them ineffective or unnecessarily costly."}
{"text": "This report documents the quasi-three-dimensional, finite-difference model, SHARP, which simulates freshwater and saltwater flow separated by a sharp interface in layered coastal aquifer systems. The model accommodates multiple aquifers separated by confining layers, with spatially variable porous media properties. The uppermost aquifer can be confined, unconfined or semi-confined with areally distributed recharge. Temporal variations in recharge and pumping are accounted for by multiple pumping periods. The boundary conditions which can be simulated in the model are: prescribed flux boundaries, constant freshwater head and/or constant saltwater head boundaries, and leaky head-dependent boundaries. For each aquifer, the vertically integrated freshwater and saltwater flow equations are solved. These two equations are coupled by the boundary condition at the interface. Leakage between aquifers is calculated by applying Darcy's law. The resulting system of coupled, non-linear partial differential equations is discretized using an implicit finite-difference scheme. The discretized system of equations is solved using the strongly implicit procedure (SIP). The positions of the interface tip and toe, within the discretized finite-difference grid blocks, are tracked using linear extrapolation of the interface elevations calculated at grid points. This documentation includes an overview of saltwater intrusion modeling approaches and the mathematical formulation of SHARP. The model is verified against experimental and analytical solutions, and sample areal and crosssectional applications are presented."}
{"text": "This program is designed to facilitate conducting sliding-block analysis (also called permanent-deformation analysis) of slopes in order to estimate slope behavior during earthquakes. The program allows selection from among more than 2,100 strong-motion records from 28 earthquakes and allows users to add their own records to the collection. Any number of earthquake records can be selected using a search interface that selects records based on desired properties. Sliding-block analyses, using any combination of rigid-block (Newmark), decoupled, and fully coupled methods, are then conducted on the selected group of records, and results are compiled in both graphical and tabular form. Simplified methods for conducting each type of analysis are also included."}
{"text": "SPARROW (SPAtially Referenced Regressions On Watershed attributes) is a watershed modeling technique for relating water-quality measurements made at a network of monitoring stations to attributes of the watersheds containing the stations. The core of the model consists of a nonlinear regression equation describing the non-conservative transport of contaminants from point and diffuse sources on land to rivers and through the stream and river network. The model predicts contaminant flux, concentration, and yield in streams and has been used to evaluate alternative hypotheses about the important contaminant sources and watershed properties that control transport over large spatial scales."}
{"text": "The main objective of this study is to present an improved modeling technique called Vegetation ET (VegET) that integrates commonly used water balance algorithms with remotely sensed Land Surface Phenology (LSP) parameter to conduct operational vegetation water balance modeling of rainfed systems at the LSP’s spatial scale using readily available global data sets. Evaluation of the VegET model was conducted using Flux Tower data and two-year simulation for the conterminous US. The VegET model is capable of estimating actual evapotranspiration (ETa) of rainfed crops and other vegetation types at the spatial resolution of the LSP on a daily basis, replacing the need to estimate crop- and region-specific crop coefficients."}
{"text": "The reasons that lead some animals to seasonally migrate, and others to remain in the same area year‐round, are poorly understood. Associations between traits, such as body size, and migration provide clues. For example, larger species and individuals are more likely to migrate. One explanation for this size bias in migration is that larger animals are capable of moving faster (movement hypothesis). However, body size is linked to many other biological processes. For instance, the energetic balances of larger animals are generally more sensitive to variation in food density because of body size effects on foraging and metabolism and this sensitivity could drive migratory decisions (forage hypothesis). Identifying the primary selective forces that drive migration ultimately requires quantifying fitness impacts over the full annual migratory cycle. Here, we develop a full annual migratory cycle model from metabolic and foraging theory to compare the importance of the forage and movement hypotheses. We parameterize the model for Galapagos tortoises, which were recently discovered to be size‐dependent altitudinal migrants.  The model predicts phenomena not included in model development including maximum body sizes, the body size at which individuals begin to migrate, and the seasonal timing of migration and these predictions generally agree with available data. Scenarios strongly support the forage hypothesis over the movement hypothesis. Furthermore, male Galapagos tortoises on Santa Cruz Island would be unable to grow to their enormous sizes without access to both highlands and lowlands. Whereas recent research has focused on links between traits and the migratory phases of the migratory cycle, we find that effects of body size on the non‐migratory phases are far more important determinants of the propensity to migrate. Larger animals are more sensitive to changing forage conditions than smaller animals with implications for maintenance of migration and body size in the face of environmental change."}
{"text": "A new version of the computer program 1DTempPro extends the original code to include new capabilities for (1) automated parameter estimation, (2) layer heterogeneity, and (3) time‐varying specific discharge. The code serves as an interface to the U.S. Geological Survey model VS2DH and supports analysis of vertical one‐dimensional temperature profiles under saturated flow conditions to assess groundwater/surface‐water exchange and estimate hydraulic conductivity for cases where hydraulic head is known."}
{"text": "Climate change is expected to alter the distributions and community composition of stream fishes in the Great Lakes region in the 21st century, in part as a result of altered hydrological systems (stream temperature, streamflow, and habitat). Resource managers need information and tools to understand where fish species and stream habitats are expected to change under future conditions. Fish sample collections and environmental variables from multiple sources across the United States Great Lakes Basin were integrated and used to develop empirical models to predict fish species occurrence under present-day climate conditions. Random Forests models were used to predict the probability of occurrence of 13 lotic fish species within each stream reach in the study area. Downscaled climate data from general circulation models were integrated with the fish species occurrence models to project fish species occurrence under future climate conditions. The 13 fish species represented three ecological guilds associated with water temperature (cold, cool, and warm), and the species were distributed in streams across the Great Lakes region. Vulnerability (loss of species) and opportunity (gain of species) scores were calculated for all stream reaches by evaluating changes in fish species occurrence from present-day to future climate conditions. The 13 fish species included 4 cold-water species, 5 cool-water species, and 4 warm-water species. Presently, the 4 cold-water species occupy from 15 percent (55,000 kilometers [km]) to 35 percent (130,000 km) of the total stream length (369,215 km) across the study area; the 5 cool-water species, from 9 percent (33,000 km) to 58 percent (215,000 km); and the 4 warm-water species, from 9 percent (33,000 km) to 38 percent (141,000 km). Fish models linked to projections from 13 downscaled climate models projected that in the mid to late 21st century (2046–65 and 2081–2100, respectively) habitats suitable for all 4 cold-water species and 4 of 5 cool-water species under present-day conditions will decline as much as 86 percent and as little as 33 percent, and habitats suitable for all 4 warm-water species will increase as much as 33 percent and as little as 7 percent. This report documents the approach and data used to predict and project fish species occurrence under present-day and future climate conditions for 13 lotic fish species in the United States Great Lakes Basin. A Web-based decision support mapping application termed “FishVis” was developed to provide a means to integrate, visualize, query, and download the results of these projected climate-driven responses and help inform conservation planning efforts within the region."}
{"text": "OTEQ is a mathematical simulation model used to characterize the fate and transport of waterborne solutes in streams and rivers. The model is formed by coupling a solute transport model with a chemical equilibrium submodel. The solute transport model is based on OTIS, a model that considers the physical processes of advection, dispersion, lateral inflow, and transient storage. The equilibrium submodel is based on MINTEQ, a model that considers the speciation and complexation of aqueous species, acid-base reactions, precipitation/dissolution, and sorption. Within OTEQ, reactions in the water column may result in the formation of solid phases (precipitates and sorbed species) that are subject to downstream transport and settling processes. Solid phases on the streambed may also interact with the water column through dissolution and sorption/desorption reactions. Consideration of both mobile (waterborne) and immobile (streambed) solid phases requires a unique set of governing differential equations and solution techniques that are developed herein. The partial differential equations describing physical transport and the algebraic equations describing chemical equilibria are coupled using the sequential iteration approach. The model’s ability to simulate pH, precipitation/dissolution, and pH-dependent sorption provides a means of evaluating the complex interactions between instream chemistry and hydrologic transport at the field scale. This report details the development and application of OTEQ. Sections of the report describe model theory, input/output specifications, model applications, and installation instructions. OTEQ may be obtained over the Internet at http://water.usgs.gov/software/OTEQ. "}
{"text": "The ability to predict the distribution of submersed aquatic vegetation in the Upper Mississippi River on the basis of physical or chemical variables is useful to resource managers. Wildlife managers have a keen interest in advanced estimates of food quantity such as American wildcelery (Vallisneria americana) population status to give out more informed advisories to hunters before the fall hunting season. Predictions for distribution of submerged aquatic vegetation beds can potentially increase hunter observance of voluntary avoidance zones where foraging birds are left alone to feed undisturbed. In years when submersed aquatic vegetation is predicted to be scarce in important wildlife habitats, managers can get the message out to hunters well before the hunting season (Jim Nissen, Upper Mississippi River National Wildlife and Fish Refuge, La Crosse District Manager, La Crosse, Wisconsin, personal communication). We developed a statistical model to predict the probability of occurrence of submersed aquatic vegetation in Pool 8 of the Upper Mississippi River on the basis of a few hydrological, physical, and geomorphic variables. Our model takes into consideration flow velocity, wind fetch, bathymetry, growing-season daily water level, and light extinction coefficient in the river (fig. 1) and calculates the probability of submersed aquatic vegetation existence in Pool 8 in individual 5- x 5-m grid cells. The model was calibrated using the data collected in 1998 (516 sites), 1999 (595 sites), and 2000 (649 sites) using a stratified random sampling protocol (Yin and others, 2000b). To validate the model, we chose the data from the Upper Mississippi River Restoration (UMRR) Program Long Term Resource Monitoring (LTRM) element transect sampling in backwater areas (Rogers and Owens 1995; Yin and others, 2000a) and ran the model for each 5- x 5-m grid cell in every growing season from 1991 to 2001. We tallied all the cells and came up with an annual average percent frequency of submersed aquatic vegetation occurrence and compared the results with actual UMRR LTRM survey data (fig. 2). Both a paired Student's test (P = 0.4620) and a Wilcoxon's two-sample test (P = 0.4738) did not contradict our null hypothesis that the model prediction and the sampling data are statistically the same. We have not found an effective statistical test to compare model-predicted spatial pattern with aerial photography geographic information, but we are satisfied with the model's outcome on the basis of visual inspection (fig. 3). A unique feature about this model is that a prediction can be made by the end of June each year; therefore, providing wildlife managers an assessment of current year vegetation growth condition 3 to 4 months ahead of the arrival of migrating waterfowl that feed on submersed aquatic vegetation. We are working with the UMRR LTRM partnership to create a mechanism so that model predictions (fig. 4) can be updated annually and the results posted on the UMRR LTRM Web site. Our model underestimated the prevalence of vegetation from 2001 to 2004. We speculate that the summer water level reduction conducted in 2001 and 2002 triggered vegetation responses that are outside the model's domain. Future enhancement of the model will incorporate the summer water level drawdown effects as well as the effects of growth conditions in previous years."}
{"text": "The U.S. Geological Survey (USGS) has developed the PRObability of Streamflow PERmanence (PROSPER) model, a GIS raster-based empirical model that provides streamflow permanence probabilities (probabilistic predictions) of a stream channel having year-round flow for any unregulated and minimally-impaired stream channel in the Pacific Northwest region, U.S. The model provides annual predictions for 2004–2016 at a 30-m spatial resolution based on monthly or annually updated values of climatic conditions and static physiographic variables associated with the upstream basin. Predictions correspond to any pixel on the channel network consistent with the medium resolution National Hydrography Dataset channel network stream grid. Total annual precipitation and percent forest cover were consistently the most important predictor variables among global and most subregional models, which had error rates between 17 and 22%. Probabilities were converted to wet and dry streamflow permanence classes with an associated confidence. Wet and dry classifications were used to derive descriptors that characterize the statistical and spatial distribution of streamflow permanence in three focal basins. Predicted dry channel segments account for 52–92% of the stream network across the three focal basins; streamflow permanence decreased during climatically drier years. Predictions are publicly available through the USGS StreamStats platform. Results demonstrate the utility of the PROSPER model as a tool for identifying areas that may be resilient or sensitive to drought conditions, allowing for management efforts that target protecting critical reaches. Importantly, PROSPER’s successful predictive performance can be improved with new datasets of streamflow permanence underscoring the importance of field observations."}
{"text": "Note: This is an external, non-USGS model, but is included in the catalog because of its usage within USGS.FaSTMECH (Flow and Sediment Transport with Morphological Evolution of Channels)” is a quasi-steady two and three-dimensional river flow and morphodynamics solver developed by Dr. Jonathan Nelson of the U.S. Geological Survey (USGS). Because FaSTMECH is developed under the quasi-steady approximation, meaning that discharge varies, but unsteady terms are neglected in the equations of motion, the solver has no Courant condition and can perform spatially detailed calculations over relatively long time scales extremely quickly. The quasi-three-dimensional version also provides explicit estimates of primary and secondary flow vertical structure, so flow solutions are provided throughout the flow for complex habitat or particle tracking problems that require three-dimensional flow without the computational expense of a fully three-dimensional model."}
{"text": "The VS2DRTI package contains all the tools that a user needs to create, run, and view results for a simulation of flow and heat and reactive solute transport through variably saturated porous media. The package seamlessly integrates a graphical user interface--within which the user can draw the simulated domain and enter or modify model parameters--with existing USGS models of flow, heat transport (VS2DH), solute transport (VS2DT), and geochemical reaction (PHREEQC). A postprocessor can display simulation results. VS2DRTI extends the capabilities of software package VS2DI Version 1.3.The VS2DRTI software package includes two applications:VS2DRTI for simulation of water and heat and solute transport VS2POST a standalone postprocessor for viewing results saved from previous simulation runs Experienced users of VS2DI will find that it is now easy to construct simulations of reactive solute transport.New users will find that the VS2DRTI package allows for easy and rapid examination of water and contaminant (or heat) movement through various different hydrologic regimes. It is an excellent tool for hypothesis testing (for example, for looking at the influence that the shape, position, and hydraulic characteristics of a layer of low permeability have on the movement of a contaminant infiltrating from the soil surface). VS2DRTI is also very useful for teaching the basics of soil physics and subsurface contaminant transport. Typical applications of the programs are for studies of ground-water recharge, surface-water-ground-water exchange, and contaminant transport from waste disposal sites. An extensive on-line help manual provides all the information necessary to run the programs."}
{"text": "A FORTRAN 77 version of the PL/1 computer program for the geochemical model WATEQ2, which computes major and trace element speciation and mineral saturation for natural waters, has been developed. The code WATEQ4F has been adapted to execute on an IBM PC1 or compatible microcomputer with or without an 8087, 80287 or 80387 numeric coprocessor and, if recompilation is desired, a full-featured microcomputer FORTRAN compiler. The calculation procedure is identical to WATEQ2, which has been installed on many mainframes and minicomputers. Several data base revisions have been made that include the addition of Se (-II, 0, IV, VI) and U (HI, IV, V, VI) species as well as the recently published values of Nordstrom and others (1990). A new set of redox options has been introduced so that all species that would exist in a disequilibrium system can be independently calculated, or selected species can be coupled, at the desire of the user. This report provides all the reactions and references for the complete data base, instructions for program operation, and an explanation of the input and output files. Attachments contain sample output from four water analyses used as test cases, and the complete source listings for WATEQ4F, its thermodynamic data base, input data preparation program WQ4FINPT, and a batch program to run WATEQ4F. The thermodynamic mass transfer program PHREEQE and the revised version of mass balance program BALANCE (BALN INPT) also have been adapted to execute on a personal microcomputer with the same specifications as those described above."}
{"text": "Simple Fortran 77 programs implement three published methods of limit-equilibrium slope-stability analysis that have been used in post-landslide investigations. The report includes a user guide and tutorial, sample data files, source code, and compiled programs for Windows 95/98/NT and the Mac OS. The programs use text files for input and output. Users can create foreign-language versions without recompiling the programs by editing the initialization files."}
{"text": "VFLUX is a program that calculates one-dimensional vertical fluid flow (seepage flux) through saturated porous media, using heat transport equations. It uses temperature time series data measured by multiple temperature sensors in a vertical profile in order to calculate flux at specific times and depths. VFLUX is written as a MATLAB toolbox, a set of functions that run in the MATLAB environment."}